data/Parm_PH_29/alpha_15/alpha_15_10929_3036/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.72 0 0);

boundaryField
{

    bottomWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    topWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    inlet_half0
    {
        type            cyclic;
    }

    inlet_half1
    {
        type            cyclic;
    }

    outlet_half0
    {
        type            cyclic;
    }

    outlet_half1
    {
        type            cyclic;
    }

    sideRight_half0
    {
        type            empty;
    }

    sideRight_half1
    {
        type            empty;
    }

    sideLeft_half0
    {
        type            empty;
    }

    sideLeft_half1
    {
        type            empty;;
    }

}

// ************************************************************************* //
