data/Parm_PH_29/alpha_15/alpha_15_10929_3036/0/tauij_LES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      tauij_LES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor>
15600
(
(0.00251101 -0.00001022 0.00000000 0.00000044 0.00000000 0.00131368)
(0.00328577 -0.00002297 0.00000000 0.00000274 0.00000000 0.00153957)
(0.00235265 -0.00001506 0.00000000 -0.00000400 0.00000000 0.00094526)
(0.00162493 -0.00003330 0.00000000 0.00000045 0.00000000 0.00142331)
(0.00047465 -0.00014673 0.00000000 0.00006512 0.00000000 0.00051433)
(0.00114767 0.00005906 0.00000000 -0.00005131 0.00000000 0.00141207)
(0.00030883 -0.00017440 0.00000000 0.00011768 0.00000000 0.00033879)
(0.00034523 -0.00041109 0.00000000 0.00036005 0.00000000 0.00103384)
...
)
;

boundaryField
{
    bottomWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    topWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    inlet_half0
    {
        type        cyclic;
    }
    inlet_half1
    {
        type        cyclic;
    }
    outlet_half0
    {
        type        cyclic;
    }
    outlet_half1
    {
        type        cyclic;
    }
    sideRight_half0
    {
        type        empty;
    }
    sideRight_half1
    {
        type        empty;
    }
    sideLeft_half0
    {
        type        empty;
    }
    sideLeft_half1
    {
        type        empty;
    }
}

// ************************************************************************* //
